import java.util.Scanner;

public class Lab4ForStd {
    public static int maxsize = 5; //กำหนดค่าคงที่ชื่อว่า maxsize เพื่อใช้ระบุขนาดสูงสุดของคิว โดยในที่นี้กำหนดให้คิวสามารถเก็บข้อมูลได้ทั้งหมด 5 ค่า ตามเงื่อนไขของโจทย์
    public static int[] number = new int[maxsize]; //สร้าง Array ชื่อ number โดยมีขนาดเท่ากับ maxsize และแต่ละช่องจะเก็บข้อมูลประเภทจำนวนเต็ม
	
    
//STEP 1: โปรแกรมเริ่มทำงาน
    public static void main (String[] args) {
//STEP 2: เตรียมตัวแปร
        Scanner input = new Scanner(System.in); // รับข้อมูลจากผู้ใช้ผ่านทางคีย์บอร์ด โดยจะนำค่าที่ผู้ใช้ป้อนเข้ามาไปใช้ในโปรแกรมต่อไป
        int num; //ประกาศตัวแปรชื่อ num ซึ่งมีชนิดเป็นจำนวนเต็ม ใช้สำหรับเก็บค่าที่ผู้ใช้กรอกเข้ามาในแต่ละครั้ง
		
//STEP 3: เริ่มรับข้อมูลเข้าคิว (Enqueue) 
        for(int i = 0; i < maxsize; i++) { //ใช้ลูป for เพื่อทำงานซ้ำทั้งหมด 5 รอบ โดยตัวแปร i จะเริ่มจาก 0 ไปจนถึง 4 ซึ่งจะใช้เป็นตำแหน่งในการเก็บข้อมูลลงในอาร์เรย์
            
            //สำหรับแสดงข้อความเพื่อแจ้งให้ผู้ใช้ทราบว่ากำลังกรอกข้อมูลตัวที่เท่าไร โดยใช้ (i + 1) เพื่อให้แสดงผลเป็นลำดับที่มนุษย์เข้าใจ เช่น 1, 2, 3 แทน 0, 1, 2
            do {
                System.out.print("Enqueue Data " + (i + 1) + " : ");
                num = input.nextInt();
                
         
            } while (num <= 0);  //เป็นการใช้ลูปตรวจสอบเงื่อนไข เพื่อให้มั่นใจว่าตัวเลขที่ผู้ใช้ใส่มาต้อง มากกว่า 0 เท่านั้น หากใส่เลข 0 หรือติดลบ โปรแกรมจะบังคับให้พิมพ์ใหม่ทันที
//STEP 4: คิวเต็ม
            enqueue(i, num); //บรรทัดนี้เป็นการเรียกใช้เมธอด enqueue โดยส่งค่าตำแหน่ง i และค่าที่ผู้ใช้กรอก num เข้าไป เพื่อทำการเก็บข้อมูลลงในอาร์เรย์ ซึ่งทำหน้าที่เป็นคิว
        }
        
        // เมื่อวนลูปครบ 5 ครั้ง แสดงว่าคิวเต็ม
        System.out.println("\nQueue is full.\n"); // เมื่อจบลูป 5 รอบ โปรแกรมจะแจ้งว่าคิวเต็มแล้ว
       
//STEP 5: เริ่มดึงข้อมูลออก (Dequeue)     
        dequeue(); // ขั้นตอนที่ 2: บรรทัดนี้เป็นการเรียกใช้เมธอด dequeue เพื่อทำการดึงข้อมูลทั้งหมดออกจากคิวและแสดงผลให้ผู้ใช้เห็น
        
//STEP 7: จบโปรแกรม        
        input.close(); //ปิดการใช้งาน Scanner
    }
	
    public static void dequeue() { // การนำข้อมูลออกจากคิว และแสดงผลข้อมูลทั้งหมดที่อยู่ในอาร์เรย์ (Index 0 ไปจนถึงสุดท้าย)
       
//STEP 6: แสดงข้อมูลทีละตัว
    	//for ที่ใช้วนแสดงข้อมูลทั้งหมดในคิว ตั้งแต่ตัวแรกไปจนถึงตัวสุดท้าย
        for (int i = 0; i < maxsize; i++) { 
            System.out.println("Dequeue Data " + (i + 1) + " : " + number[i]); //แสดงค่าข้อมูลในแต่ละตำแหน่งของอาร์เรย์ โดยเรียงตามลำดับที่ถูกใส่เข้ามา
        }
        
        // บรรทัดนี้แสดงข้อความว่าคิวว่าง หลังจากที่ข้อมูลทั้งหมดถูกแสดงออกมาแล้ว
        System.out.println("\nQueue is empty.");
    }
		
    public static void enqueue(int i, int num) { //การประกาศเมธอด enqueue ซึ่งมีหน้าที่ในการรับค่าตำแหน่งและค่าข้อมูล เพื่อใช้ในการเก็บข้อมูลลงในอาร์เรย์
        //บรรทัดนี้เป็นการนำค่าที่รับเข้ามาไปเก็บในอาร์เรย์ตำแหน่งที่ i ซึ่งเป็นตำแหน่งที่กำหนดจากลูป for
        number[i] = num;
    }
}
